//
//  chance.m
//  SD_bot
//
//  Created by SuperD on 12/9/23.
//  Copyright (c) 2012年 SuperD. All rights reserved.
//

#import "chance.h"

@implementation chance

@synthesize res;

-(id)init
{
    if(self = [super init])
    {
        //res = @"test1234 change obj";
    }
    return self;
}

-(NSString *)dice
{
    NSArray *all = [NSArray arrayWithObjects:
                    @"王籤\r求得籤王百事良\r萬事如意大吉昌\r宜加力作行方便\r可保福壽永安康",
                    @"第一籤【大吉。甲甲】\r巍巍獨步向雲間\r玉殿千官第一班\r富貴榮華天付汝\r福如東海壽如山",
                    @"第二籤【上吉。甲乙】\r盈虛消息總天時\r自此君當百事宜\r若問前程歸縮地\r更須方寸好修為",
                    @"第三籤【中吉。甲丙】\r衣食自然生處有\r勸君不用苦勞心\r但能孝悌存忠信\r福祿來成禍不侵",
                    @"第四籤【下下。甲丁】\r去年百事頗相宜\r若較今年時運衰\r好把瓣香告神佛\r莫教福謝悔無追",
                    @"第五籤【中平。甲戊】\r子有三般不自由\r門庭蕭索冷如秋\r若逢牛鼠交承日\r萬事回春不用憂",
                    @"第六籤【下下。甲己】\r何勞鼓瑟更吹笙\r寸步如登萬里程\r彼此懷疑不相信\r休將私意憶濃情",
                    @"第七籤【大吉。甲庚】\r仙風道骨本天生\r又遇仙宗為主盟\r指日丹成謝巖谷\r一朝引領向天行",
                    @"第八籤【上上。甲辛】\r年來耕稼苦無收\r今歲田疇定有秋\r況遇太平無事日\r士農工賈百無憂",
                    @"第九籤【大吉。甲壬】\r望渠消息向長安\r常把菱花仔細看\r見說文書將入境\r今朝喜色上眉端",
                    @"第十籤【下下。甲癸】\r病患時時命蹇衰\r何須打瓦共鑽龜\r直教重見一陽復\r始可求神仗佛持",
                    @"第十一籤【下下。乙甲】\r今年好事一番新\r富貴榮華萃汝身\r誰道機關難料處\r到頭獨立轉傷神",
                    @"第十二籤【中平。乙乙】\r營為期望在春前\r誰料秋來又不然\r直遇清江貴公子\r一生活計始安全",
                    @"第十三籤【中平。乙丙】\r君今庚甲未亨通\r且向江頭作釣翁\r玉兔重生應發跡\r萬人頭上逞英雄",
                    @"第十四籤【下下。乙丁】\r一見佳人便喜歡\r誰知去後有多般\r人情冷暖君休訝\r歷涉應知行路難",
                    @"第十五籤【中平。乙戊】\r兩家門戶各相當\r不是姻緣莫較量\r直待春風好消息\r卻調琴瑟向蘭房",
                    @"第十六籤【下下。乙己】\r官事悠悠難辨明\r不如息了且歸耕\r傍人煽惑君休信\r此事當謀親弟兄",
                    @"第十七籤【下下。乙庚】\r田園價貫好商量\r事到公庭彼此傷\r縱使機關圖得勝\r定為後世子孫殃",
                    @"第十八籤【中平。乙辛】\r知君指擬是空華\r底事茫茫未有涯\r牢把腳根踏實地\r善為善應永無差",
                    @"第十九籤【上吉。乙壬】\r嗟子從來未得時\r今年星運頗相宜\r營求動作都如意\r和合婚姻誕貴兒",
                    @"第二十籤【下下。乙癸】\r一生心事向誰論\r十八灘頭說與君\r世事盡從流水去\r功名富貴等浮雲",
                    @"第二十一籤【下下。丙甲】\r與君夙昔結成冤\r今日相逢那得緣\r好把經文多諷誦\r祈求戶內保嬋娟",
                    @"第二二籤【上吉。丙乙】\r碧玉池中開白蓮\r莊嚴色相自天然\r生來骨格超凡俗\r正是人間第一仙",
                    @"第二三籤【下下。丙丙】\r花開花謝在春風\r貴賤窮通百歲中\r羨子榮華今已矣\r到頭萬事總成空",
                    @"第二四籤【中平(中吉)。丙丁】\r一春萬事苦憂煎\r夏裡營求始帖然\r更遇秋成冬至後\r恰如騎鶴與腰纏",
                    @"第二五籤【中平。丙戊】\r寅午戍年多阻滯\r亥子丑月漸亨嘉\r更逢玉兔金雞會\r枯木逢春自放花",
                    @"第二六籤【中吉。丙己】\r年來豐歉皆天數\r自是今年旱較多\r與子定期三日內\r田疇霑足雨滂沱",
                    @"第二七籤【下下(中平)。丙庚】\r世間萬物各有主\r一粒一毫君莫取\r英雄豪傑自天生\r也須步步循規矩",
                    @"第二八籤【上吉。丙辛】\r公侯將相本無種\r好把勤勞契上天\r人事盡從天理見\r才高豈得困林泉",
                    @"第二九籤【上上。丙壬】\r祖宗積德幾多年\r源遠流長慶自然\r若更操修無倦已\r天須還汝舊青氈",
                    @"第三十籤【中吉。丙癸】\r奉公謹守莫欺心\r自有亨通吉利臨\r目下營求且休矣\r秋期與子定佳音",
                    @"第三一籤【中吉。丁甲】\r秋冬作事只尋常\r春到門庭漸吉昌\r千里信結符遠望\r萱堂快樂未渠央",
                    @"第三二籤【下下。丁乙】\r勞心汨汨竟何歸\r疾病兼多是與非\r事到頭來渾似夢\r何如休要用心機",
                    @"第三三籤【中平(中吉)。丁丙】\r不分南北與西東\r眼底昏昏耳似聾\r熟讀黃庭經一卷\r不論貴賤與窮通",
                    @"第三四籤【中平(中吉)。丁丁】\r春夏纔過秋又冬\r紛紛謀慮攪心胸\r貴人垂手來相援\r休把私心情意濃",
                    @"第三五籤【下下。丁戊】\r一山如畫對清江\r門裡團圓事事雙\r誰料半途分折去\r空幃無語對銀缸",
                    @"第三六籤【上吉。丁己】\r功名富貴自能為\r偶著先鞭莫問伊\r萬里鵬程君有分\r吳山頂上好鑽龜",
                    @"第三七籤【中平(中吉)。丁庚】\r焚香來告復何辭\r善惡平分汝自知\r屏卻昧公心裡事\r出門無礙是通時",
                    @"第三八籤【下下。丁辛】\r蛩吟唧唧守孤幃\r千里懸懸望信歸\r等得榮華公子到\r秋冬括括雨靡靡",
                    @"第三九籤【下下(中下)。丁壬】\r若問終時慎厥初\r堪笑包藏許多事\r鱗鴻雖便莫修書\r(下字，另有改作外字一說)",
                    @"第四十籤【上吉。丁癸】\r新來換得好規模\r何用隨他步與趨\r只聽耳邊消息到\r崎嶇歷盡見亨衢",
                    @"第四一籤【中吉(上吉)。戊甲】\r自南自北自東西\r欲到天涯誰作梯\r遇鼠逢牛三弄笛\r好將名姓榜頭題",
                    @"第四二籤【中吉。戊乙】\r我曾許汝事和諧\r誰料修為汝自乖\r但改新圖莫依舊\r營謀應得稱心懷",
                    @"第四三籤【中吉。戊丙】\r一紙官書火急催\r扁舟速下浪如雷\r雖然目下多驚險\r保汝它苦去復回",
                    @"第四四籤【中平(中吉)。戊丁】\r汝是人中最吉人\r誤為誤作損精神\r堅牢一念酬香願\r富貴榮華萃汝身",
                    @"第四五籤【中平(中吉)。戊戊】\r好將心地力耕耘\r彼此山頭總是墳\r陰地不如心地好\r修為到底卻輸君",
                    @"第四六籤【中平。戊己】\r君是山中萬戶侯\r信知騎馬勝騎牛\r今朝馬上看山色\r爭似騎牛得自由",
                    @"第四七籤【下下(中平)。戊庚】\r與君萬語復千言\r祗欲平和雪爾冤\r訟則終凶君記取\r試於清夜把心捫",
                    @"第四八籤【中平(中吉)。戊辛】\r登山涉水正天寒\r兄弟姻親那得安\r幸遇虎頭人一喚\r全家遂保汝宣苦",
                    @"第四九籤【下下。戊壬】\r彼此家居只一山\r如何似隔鬼門關\r日月如梭人易老\r許多勞碌不如閒",
                    @"第五十籤【上平(上吉)。戊癸】\r人說今年勝舊年\r也須步多要周旋\r一家和氣多生福\r萋菲讒言莫聽偏",
                    @"第五一籤【上吉。己甲】\r君今百事且隨緣\r水到渠成聽自然\r莫嘆年來不如意\r喜逢新運稱心田",
                    @"第五二籤【上吉。己乙】\r兀坐幽居歎寂寥\r孤燈掩映度清宵\r萬金忽報秋光好\r活計扁舟渡北朝",
                    @"第五三籤【下下。己丙】\r艱難險阻路蹊蹺\r南鳥孤飛依北巢\r今日貴人曾識面\r相逢卻在夏秋交",
                    @"第五四籤【中平。己丁】\r萬人叢裡逞英豪\r便欲飛騰霄漢高\r爭奈承流風未便\r青燈黃卷且勤勞",
                    @"第五五籤【中平。己戊】\r勤耕力作莫蹉跎\r衣食隨時安分過\r縱使經商收倍利\r不如逐歲廩禾多",
                    @"第五六籤【下下。己己】\r心頭理曲強詞遮\r直欲欺官行路斜\r一旦醜形臨月鏡\r身投憲網莫咨嗟",
                    @"第五七籤【中平。己庚】\r事端百出慮雖長\r莫聽人言自主張\r一著仙機君記取\r紛紛鬧裡更思量",
                    @"第五八籤【上吉。己辛】\r蘇秦三寸足平生\r富貴功名在此行\r更好修為陰騭事\r前程萬里自通亨",
                    @"第五九籤【中平。己壬】\r門衰戶冷苦伶仃\r自嘆祈求不一靈\r幸有祖宗陰騭在\r香煙未斷續螟蛉",
                    @"第六十籤【上上。己癸】\r羨君兄弟好名聲\r只管謙撝莫自矜\r丹詔槐黃相逼近\r巍巍科甲兩同登",
                    @"第六一籤【中平(中吉)。庚甲】\r嘯聚山林兇惡儔\r善良無事苦煎憂\r主人大笑出門去\r不用干戈盜賊休",
                    @"第六二籤【中平(中吉)。庚乙】\r百千人面虎狼心\r賴汝干戈用力深\r得勝回時秋漸老\r虎頭城裡喜相尋",
                    @"第六三籤【中平(中吉)。庚丙】\r曩時敗北且圖南\r筋力雖衰尚一堪\r欲識生前君大數\r前三三與後三三",
                    @"第六四籤【上上。庚丁】\r吉人相遇本和同\r況有持謀天水翁\r人力不勞公論協\r事成功倍笑談中",
                    @"第六五籤【上上。庚戊】\r朔風凜凜正窮冬\r多羨門庭喜氣濃\r更入新春人事後\r衷言方得信先容",
                    @"第六六籤【上上。庚己】\r耕耘只可在鄉邦\r何用求謀向外方\r見說今年新運好\r門闌喜氣事雙雙",
                    @"第六七籤【中平。庚庚】\r纔發君心天已知\r何須問我決狐疑\r願子改圖從孝悌\r不愁家室不相宜",
                    @"第六八籤【中平(中吉)。庚辛】\r南販珍珠北販鹽\r年來幾倍貨財添\r勸君止此求田舍\r心欲多時何日厭",
                    @"第六九籤【下下(中平)。庚壬】\r捨舟遵路總相宜\r慎勿嬉遊逐貴兒\r一夜樽前兄與弟\r明朝仇敵又相隨",
                    @"第七十籤【中平(中吉)。庚癸】\r雷雨風雲各有司\r至誠禱告莫生疑\r與君定約為霖日\r正是蘊隆中伏時",
                    @"第七一籤【中平(中吉)。辛甲】\r喜鵲簷前報好音\r知君千里欲歸心\r繡幃奏窕計鴦帶\r葉落霜飛寒色侵",
                    @"第七二籤【下下(中平)。辛乙】\r河渠傍路有高低\r可歎長途日已西\r縱有榮華好時節\r直須猴犬換金雞",
                    @"第七三籤【下下。辛丙】\r憶昔蘭房分半釵\r而今忽把信音乖\r痴心指望成連理\r到底誰知事不諧",
                    @"第七四籤【上吉。辛丁】\r崔巍崔魏復崔巍\r履險如夷去復來\r身似菩提心似鏡\r長安一道放春回",
                    @"第七五籤【中吉。辛戊】\r生前結得好緣姻\r一笑相逢情自親\r相當人物無高下\r得意休論富與貧",
                    @"第七六籤【中平。辛己】\r三千法律八千文\r此事何如說與君\r善惡兩途君自作\r一生禍福此中分",
                    @"第七七籤【下下(中下)。辛庚】\r木有根荄水有源\r君當自此究其原\r莫隨道路人閒話\r訟到終凶是至言",
                    @"第七八籤【下下。辛辛】\r家道豊腴自飽溫\r也須肚裡立乾坤\r財多害己君當省\r福有胚胎禍有門",
                    @"第七九籤【中平。辛壬】\r乾亥來龍仔細看\r坎居午向自當安\r若移丑艮陰陽逆\r門戶凋零家道難",
                    @"第八十籤【中平。辛癸】\r一朝無事忽遭官\r也是門衰墳未安\r改換陰陽移禍福\r勸君莫作等閒看",
                    @"第八一籤【中平(中吉)。壬甲】\r假君財物自當還\r謀賴心欺他自奸\r幸有高臺明月鏡\r請來對照破機關",
                    @"第八二籤【上吉。壬乙】\r彼亦儔中一輩賢\r勸君特達與周旋\r此時賓主歡相會\r他日王侯卻並肩",
                    @"第八三籤【下下。壬丙】\r隨分堂前赴粥饘\r何須妄想苦憂煎\r主張門戶誠難事\r百歲安閒得幾年",
                    @"第八四籤【中平。壬丁】\r箇中事緒更紛然\r當局須知一著先\r長舌婦人休酷聽\r力行禮義要心堅",
                    @"第八五籤【中平。壬戊】\r一春風雨正瀟瀟\r千里行人去路遙\r移寡就多君得計\r如何歸路轉無聊",
                    @"第八六籤【上上(上吉)。壬己】\r一舟行貨好招邀\r積少成多自富饒\r常把他人比自己\r管須日後勝今朝",
                    @"第八七籤【下下。壬庚】\r陰裡詳看怪爾曹\r舟中敵圖笑中刀\r藩籬剖破渾無事\r一種天生惜羽毛",
                    @"第八八籤【上吉。壬辛】\r從前作事總徒勞\r纔見新春時漸遭\r百計營求都得意\r更須守己莫心高",
                    @"第八九籤【中平。壬壬】\r樽前無事且高歌\r時未來時奈若何\r白馬渡江嘶日暮\r虎頭城裡看巍峨",
                    @"第九十籤【中平。壬癸】\r崆峒城裡事如麻\r無事如君有幾家\r勸汝不須勤計禱\r徒勞生事苦咨嘆",
                    @"第九一籤【中平(中吉)。癸甲】\r佛說淘沙始見金\r只緣君子不勞心\r榮華總得詩書效\r妙裡工夫仔細尋",
                    @"第九二籤【下下(下中)。癸乙】\r今年禾穀不如前\r物價喧騰倍百年\r災數流行多疫癘\r一陽復後始安全",
                    @"第九三籤【中平。癸丙】\r春來雨水太連綿\r入夏晴乾雨又愆\r節氣直交三伏始\r喜逢滂沛足田園",
                    @"第九四籤【中平(中吉)。癸丁】\r一般器用與人同\r巧斲輪輿梓匠工\r凡事有緣且隨分\r秋冬方遇主人翁",
                    @"第九五籤【中平(中吉)。癸戊】\r知君袖內有驪珠\r生不逢辰亦強圖\r可歎頭顱已如許\r而今方得貴人扶",
                    @"第九六籤【上吉。癸己】\r婚姻子息莫嫌遲\r但把精神仗佛持\r四十年前須報應\r功圓行滿育馨兒",
                    @"第九七籤【上上。癸庚】\r五十功名心已灰\r那知富貴逼人來\r更行好事存方寸\r壽比岡陵位鼎台",
                    @"第九八籤【中平(中吉)。癸辛】\r經營百出費精神\r南北奔馳運未新\r玉兔交時當得意\r恰如枯木再逢春",
                    @"第九九籤【上上。癸壬】\r貴人遭遇水雲鄉\r冷淡交情滋味長\r黃閣開時延故客\r驊騮應得驟康莊",
                    @"第一百籤【 上上。癸癸】\r我本天仙雷雨師\r吉凶禍福我先知\r至誠禱告皆靈驗\r抽得終籤百事宜",
                    nil
                    ];
    
//    NSLog(@"in dice %@",[all objectAtIndex:arc4random()%101]);
//    return NSLog(@"in dice %@",[all objectAtIndex:0]);
    res = arc4random()%101;
    return [all objectAtIndex:res];
//    return [all objectAtIndex:0];
}

@end
